In [1]:
import pandas as pd

In [2]:
bios = pd.read_csv("bios.csv")

In [3]:
bios.head()  # Display the first few rows of the DataFrame

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [12]:
bios.loc[bios['height_cm'] > 180, ['name', 'height_cm']]  # Filter rows where height is greater than 180 cm and select specific columns

                     name  height_cm
1          Arnaud Boetsch      183.0
2            Jean Borotra      183.0
5       Nicolas Chatelain      181.0
16             Guy Forget      189.0
25          Henri Leconte      184.0
...                   ...        ...
145465  Stanislav Galiyev      188.0
145466     Mikkel Aagaard      184.0
145468  Justin Abdelkader      187.0
145473     Toms Andersons      185.0
145494      George Wright      183.0

[35368 rows x 2 columns]

In [14]:
bios[(bios['height_cm'] > 180) & (bios['born_country'] == 'USA')][['name', 'height_cm', 'born_country']]

                     name  height_cm born_country
1375        Lori Harrigan      182.0          USA
2206            Ruth Rowe      185.0          USA
2213            Jay Barrs      182.0          USA
2221           Ed Eliason      189.0          USA
2225        Butch Johnson      191.0          USA
...                   ...        ...          ...
144099      D. J. Sharabi      182.0          USA
144398            Jian An      187.0          USA
144400   Shimisi Jieruimi      183.0          USA
144977   Atle Lie McGrath      182.0          USA
145468  Justin Abdelkader      187.0          USA

[3189 rows x 3 columns]

In [15]:
bios[bios['name'].str.contains('John')][['name', 'height_cm']]  # Filter rows where name contains 'John' and select specific columns

                         name  height_cm
78           John Pius Boland        NaN
375             John McDonald      183.0
569              John Bridges        NaN
579             John Keyworth        NaN
583              John Penrose        NaN
...                       ...        ...
143841          Johnny Hooper        NaN
143851  John Stefanowicz, Jr.        NaN
143984         Keldon Johnson      196.0
145461           Kent Johnson      185.0
145488           Shakeel John        NaN

[1375 rows x 2 columns]